In [1]:
!pip install fireducks
import fireducks.pandas as pd

Collecting fireducks
  Downloading fireducks-1.2.4-cp311-cp311-manylinux_2_28_x86_64.whl.metadata (1.0 kB)
Collecting firefw==1.2.4 (from fireducks)
  Downloading firefw-1.2.4-py3-none-any.whl.metadata (818 bytes)
Requirement already satisfied: pandas<2.3.0,>=1.5.3 in /usr/local/lib/python3.11/dist-packages (from fireducks) (2.2.2)
Collecting pyarrow<19.1,>=19.0 (from fireducks)
  Downloading pyarrow-19.0.1-cp311-cp311-manylinux_2_28_x86_64.whl.metadata (3.3 kB)
Requirement already satisfied: numpy>=1.23.2 in /usr/local/lib/python3.11/dist-packages (from pandas<2.3.0,>=1.5.3->fireducks) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.11/dist-packages (from pandas<2.3.0,>=1.5.3->fireducks) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.11/dist-packages (from pandas<2.3.0,>=1.5.3->fireducks) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.11/dist-packages (from pandas<2.3.0,>=1.5.3->fireducks) (2025.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.11/dist-packages (from python-dateutil>=2.8.2->pandas<2.3.0,>=1.5.3->fireducks) (1.17.0)
Downloading fireducks-1.2.4-cp311-cp311-manylinux_2_28_x86_64.whl (7.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.3/7.3 MB 47.3 MB/s eta 0:00:00
Downloading firefw-1.2.4-py3-none-any.whl (12 kB)
Downloading pyarrow-19.0.1-cp311-cp311-manylinux_2_28_x86_64.whl (42.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 42.1/42.1 MB 12.8 MB/s eta 0:00:00
Installing collected packages: pyarrow, firefw, fireducks
  Attempting uninstall: pyarrow
    Found existing installation: pyarrow 18.1.0
    Uninstalling pyarrow-18.1.0:
      Successfully uninstalled pyarrow-18.1.0
Successfully installed fireducks-1.2.4 firefw-1.2.4 pyarrow-19.0.1

In [2]:
planets_df = pd.read_csv('https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/main/planets.csv')
planets_df.head()

,method,number,orbital_period,mass,distance,year
0,Radial Velocity,1,269.300,7.10,77.40,2006
1,Radial Velocity,1,874.774,2.21,56.95,2008
2,Radial Velocity,1,763.000,2.60,19.84,2011
3,Radial Velocity,1,326.030,19.40,110.62,2007
4,Radial Velocity,1,516.220,10.50,119.47,2009

In [20]:
planets_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [21]:
planets_df[planets_df['orbital_period'].isnull()]

,method,number,orbital_period,mass,distance,year
29,Imaging,1,NaN,NaN,45.52,2005
30,Imaging,1,NaN,NaN,165.00,2007
31,Imaging,1,NaN,NaN,140.00,2004
33,Imaging,1,NaN,NaN,NaN,2008
34,Imaging,1,NaN,NaN,145.00,2013
35,Imaging,1,NaN,NaN,139.00,2004
36,Imaging,1,NaN,NaN,18.39,2006
54,Imaging,1,NaN,NaN,52.03,2012
69,Imaging,1,NaN,NaN,145.00,2008
70,Imaging,1,NaN,NaN,36.00,2013
71,Imaging,1,NaN,NaN,140.00,2010
73,Imaging,1,NaN,NaN,52.40,2004
90,Imaging,1,NaN,NaN,NaN,2006
124,Imaging,1,NaN,NaN,17.95,2013
150,Imaging,1,NaN,NaN,145.00,2010
392,Imaging,1,NaN,NaN,91.57,2013
423,Imaging,1,NaN,NaN,91.83,2013
577,Imaging,1,NaN,NaN,40.85,2006
635,Imaging,1,NaN,NaN,11.43,2010
639,Imaging,1,NaN,NaN,131.93,2010
749,Transit Timing Variations,3,NaN,NaN,NaN,2014
902,Microlensing,1,NaN,NaN,NaN,2008
903,Microlensing,1,NaN,NaN,NaN,2008
904,Microlensing,1,NaN,NaN,NaN,2009
905,Microlensing,1,NaN,NaN,3600.00,2013
907,Microlensing,1,NaN,NaN,NaN,2010
909,Microlensing,1,NaN,NaN,2300.00,2012
910,Microlensing,1,NaN,NaN,2800.00,2012
911,Microlensing,1,NaN,NaN,7720.00,2012
912,Microlensing,1,NaN,NaN,7560.00,2013
917,Microlensing,1,NaN,NaN,NaN,2004
923,Microlensing,1,NaN,NaN,NaN,2009
924,Microlensing,1,NaN,NaN,2570.00,2012
925,Microlensing,2,NaN,NaN,4080.00,2012
926,Microlensing,2,NaN,NaN,4080.00,2012
927,Microlensing,1,NaN,NaN,1760.00,2013
928,Microlensing,1,NaN,NaN,4970.00,2013
948,Imaging,1,NaN,NaN,135.00,2013
949,Imaging,1,NaN,NaN,120.00,2013
950,Imaging,1,NaN,NaN,NaN,2010
957,Imaging,1,NaN,NaN,NaN,2008
1027,Imaging,1,NaN,NaN,19.20,2011
1029,Imaging,1,NaN,NaN,10.10,2012

In [15]:
print("Missing orbital is: ", len(planets_df[planets_df['orbital_period'].isnull()]))
print("Missing mass is: ", len(planets_df[planets_df['mass'].isnull()]))
print("Missing distance is: ", len(planets_df[planets_df['distance'].isnull()]))
print("Missing year is: ", len(planets_df[planets_df['year'].isnull()]))
print("Missing method is: ", len(planets_df[planets_df['method'].isnull()]))
print("Missing number is: ", len(planets_df[planets_df['number'].isnull()]))

Missing orbital is:  43
Missing mass is:  522
Missing distance is:  227
Missing year is:  0
Missing method is:  0
Missing number is:  0

In [19]:
len(planets_df[planets_df['orbital_period'].isnull() & planets_df['mass'].isnull()])

43

In [24]:
len(planets_df[planets_df['orbital_period'].isnull() & planets_df['mass'].isnull() & planets_df['distance'].isnull() ])

11

In [25]:
planets_missing_mass = planets_df[planets_df['mass'].isnull()]
planets_missing_mass['method'].value_counts()

method
Transit                          396
Radial Velocity                   43
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          7
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: count, dtype: int64

In [28]:
planets_missing_mass = planets_df[~(planets_df['mass'].isnull())]
planets_missing_mass['method'].value_counts()

method
Radial Velocity              510
Eclipse Timing Variations      2
Transit                        1
Name: count, dtype: int64

In [32]:
links = ['https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/main/college/students.csv'
,
'https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/main/college/clubs.csv'
,
'https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/main/college/courses.csv'
,
'https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/main/college/f15.csv'
,
'https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/main/college/s16.csv'
,
 'https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/refs/heads/main/college/careers.csv'
]

students_df = pd.read_csv(links[0])
clubs_df = pd.read_csv(links[1])
courses_df = pd.read_csv(links[2])
f15_df = pd.read_csv(links[3])
s16_df = pd.read_csv(links[4])
careers_df = pd.read_csv(links[5])

print(students_df.head(),'\n')
print(clubs_df.head(), '\n')
print(courses_df.head(), '\n')
print(f15_df.head(), '\n')
print(s16_df.head(), '\n')
print(careers_df.head())

        id     name
0  7798814    Keith
1  2149193   Denise
2  5062031   Edward
3  7361386  Jeffery
4  5484525  Spencer

   student_id                 club
0     7798814              CS Club
1     2149193              CS Club
2     5062031  Cryptocurrency Club
3     7361386        Robotics Club
4     5484525    Entrepreneur Club

     id                            name
0  1001  Computing &Quantitative Reason
1  1002   The Outer Limits of Reasoning
2  1003              Exploring Robotics
3  1050  Intro to Computer Applications
4  1115       Intro to JAVA Programming

   student_id  course grade  points_earned  max_points
0     7798814    1600     a              4           4
1     7798814    1002     a              4           4
2     2149193    1400     a              4           4
3     2149193    1003     b              3           4
4     2149193    1580     a              4           4

   student_id  course grade  points_earned  max_points
0     7798814    2210     a              4           4
1     7798814    1215     b              3           4
2     2149193    1600     a              4           4
3     2149193    1170     b              3           4
4     2149193    1597     a              4           4

        id         career
0  7798814     publishing
1  2149193      education
2  5062031       graphics
3  7361386  self-employed
4  5484525      logistics

In [35]:
student1 = pd.merge(students_df, careers_df, left_on='id', right_on='id')
student1.head()

,id,name,career
0,7798814,Keith,publishing
1,2149193,Denise,education
2,5062031,Edward,graphics
3,7361386,Jeffery,self-employed
4,5484525,Spencer,logistics

In [51]:
f15c = pd.merge(f15_df, courses_df, left_on='course', right_on='id')
print(f15c.head(),'\n\n')

s16c = pd.merge(s16_df, courses_df, left_on='course', right_on='id')
print(s16c.head())

   student_id  course grade  points_earned  max_points    id  \
0     7798814    1600     a              4           4  1600
1     7798814    1002     a              4           4  1002
2     2149193    1400     a              4           4  1400
3     2149193    1003     b              3           4  1003
4     2149193    1580     a              4           4  1580

                            name
0             Intro Multi Comput
1  The Outer Limits of Reasoning
2            Elementary Robotics
3             Exploring Robotics
4       Computer Mangement Games


   student_id  course grade  points_earned  max_points    id  \
0     7798814    2210     a              4           4  2210
1     7798814    1215     b              3           4  1215
2     2149193    1600     a              4           4  1600
3     2149193    1170     b              3           4  1170
4     2149193    1597     a              4           4  1597

                             name
0              Discrete Structure
1  Intro to Programming in Python
2              Intro Multi Comput
3            Java for Programmers
4          New Media and Business

In [52]:
student2 = pd.merge(student1, clubs_df, left_on='id', right_on='student_id')
student2 = student2.drop(columns=['student_id'], axis=1)
print(student2.head(),'\n\n')

fs2526 = pd.merge(f15c, s16c, left_on='student_id', right_on='student_id')
print(fs2526.head())

        id     name         career                 club
0  7798814    Keith     publishing              CS Club
1  2149193   Denise      education              CS Club
2  5062031   Edward       graphics  Cryptocurrency Club
3  7361386  Jeffery  self-employed        Robotics Club
4  5484525  Spencer      logistics    Entrepreneur Club


   student_id  course_x grade_x  points_earned_x  max_points_x  id_x  \
0     7798814      1600       a                4             4  1600
1     7798814      1600       a                4             4  1600
2     7798814      1002       a                4             4  1002
3     7798814      1002       a                4             4  1002
4     2149193      1400       a                4             4  1400

                          name_x  course_y grade_y  points_earned_y  \
0             Intro Multi Comput      2210       a                4
1             Intro Multi Comput      1215       b                3
2  The Outer Limits of Reasoning      2210       a                4
3  The Outer Limits of Reasoning      1215       b                3
4            Elementary Robotics      1600       a                4

   max_points_y  id_y                          name_y
0             4  2210              Discrete Structure
1             4  1215  Intro to Programming in Python
2             4  2210              Discrete Structure
3             4  1215  Intro to Programming in Python
4             4  1600              Intro Multi Comput

In [53]:
student_info = pd.merge(student2, fs2526, left_on='id', right_on='student_id')
student_info = student_info.drop(columns=['student_id'], axis=1)
student_info.head()

,id,name,career,club,course_x,grade_x,points_earned_x,max_points_x,id_x,name_x,course_y,grade_y,points_earned_y,max_points_y,id_y,name_y
0,7798814,Keith,publishing,CS Club,1600,a,4,4,1600,Intro Multi Comput,2210,a,4,4,2210,Discrete Structure
1,7798814,Keith,publishing,CS Club,1600,a,4,4,1600,Intro Multi Comput,1215,b,3,4,1215,Intro to Programming in Python
2,7798814,Keith,publishing,CS Club,1002,a,4,4,1002,The Outer Limits of Reasoning,2210,a,4,4,2210,Discrete Structure
3,7798814,Keith,publishing,CS Club,1002,a,4,4,1002,The Outer Limits of Reasoning,1215,b,3,4,1215,Intro to Programming in Python
4,2149193,Denise,education,CS Club,1400,a,4,4,1400,Elementary Robotics,1600,a,4,4,1600,Intro Multi Comput

#  Use merging to produce a DataFrame showing which students belong to which clubs.

In [59]:
students_clubs = pd.merge(students_df, clubs_df, left_on='id', right_on='student_id')
students_clubs.head()

,id,name,student_id,club
0,7798814,Keith,7798814,CS Club
1,2149193,Denise,2149193,CS Club
2,5062031,Edward,5062031,Cryptocurrency Club
3,7361386,Jeffery,7361386,Robotics Club
4,5484525,Spencer,5484525,Entrepreneur Club

# Are there any students who are not in any clubs? If so, how many? Show their names and student ID.

In [62]:
students_not_in_clubs = students_df[~students_df['id'].isin(clubs_df['student_id'])]
students_not_in_clubs

,id,name
8,3822320,Jon
9,9548347,Jennifer
10,5131111,Leah
11,2227757,Grace
12,1802931,Troy
...,...,...
481,8591058,Victor
485,2155099,Karen
487,4912478,Cristina
491,1017481,Danielle
492,6345509,Robin

# Use merging to produce a DataFrame showing the names of courses that students enrolled in.

In [70]:
f15_courses = pd.merge(f15_df, courses_df, left_on='course', right_on='id')
f15_courses['name'].value_counts()

name
Intro Multi Comput                107
Intro to Programming in Python    105
The Outer Limits of Reasoning     101
Java for Programmers              101
Electronic Commerce                97
Computing &Quantitative Reason     93
Computer Mangement Games           92
Intro to Computer Applications     91
Intro to JAVA Programming          91
New Media and Business             90
Elementary Robotics                89
Management Information Systems     89
Exploring Robotics                 88
Name: count, dtype: int64

In [71]:
s16_courses = pd.merge(s16_df, courses_df, left_on='course', right_on='id')
s16_courses = s16_courses[['student_id', 'name']]
s16_courses['name'].value_counts()

name
Discrete Structure                82
Java for Programmers              80
New Media and Business            79
Elementary Robotics               78
Intro Multi Comput                74
The Outer Limits of Reasoning     74
Exploring Robotics                73
Management Information Systems    73
Electronic Commerce               72
Computing &Quantitative Reason    70
Intro to Computer Applications    68
Computer Mangement Games          66
Intro to JAVA Programming         60
Intro to Programming in Python    57
Name: count, dtype: int64